
&НаКлиенте
Процедура Экз_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	
	ТекущаяСтрокаТЧТовары  = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрокаТЧТовары.Экз_НижнийПорогРентабельности = РассчитатьНижнийПорогРентабельностиДляСтрокиТЧТовары(ТекущаяСтрокаТЧТовары.Номенклатура
	,ТекущаяСтрокаТЧТовары.Характеристика);
	
	
	
КонецПроцедуры        



&НаСервере
Функция РассчитатьНижнийПорогРентабельностиДляСтрокиТЧТовары(ТекущаяСтрокаТЧТовары.Номенклатура,ТекущаяСтрокаТЧТовары.Характеристика)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних";
	
	
	// Устанавливвем параметры
	//  Дата ДОКУМЕНТА !!!
	Запрос.УстановитьПараметр("Дата", Объект.Дата); 
	
	// Отдельно получаем из Спр. 
	ВидЦены_НижнийПорогРентабельности = Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор","НижнийПорогРентабельности"); 
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены_НижнийПорогРентабельности);
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НижнийПорогРентабельности = 0; 
	
	Если Выборка.Следующий() Тогда
		
		НижнийПорогРентабельности = Выборка.Цена;
		
	КонецЕсли;
	
	Возврат НижнийПорогРентабельности 
	
КонецФункции        



&НаСервере
Процедура РассчитатьНижнийПорогРентабельностиДляТЧТовары()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ВТ_Товары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВТ_Товары.Номенклатура
		|			И ЦеныНоменклатурыСрезПоследних.Характеристика = ВТ_Товары.Характеристика";
	
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ВидЦены", "НижнийПорогРентабельности");
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрОтбора = Новый Структура("НомерСтроки", Выборка.НомерСтроки);
		Строка =  Объект.Товары.НайтиСтроки(ПараметрОтбора);
		Строка[0].Экз_НижнийПорогРентабельности = Выборка.Цена;
		
	КонецЦикла;	
	
	
КонецПроцедуры 
