
&После("ОбработкаПроведения")
Процедура Экз_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если  Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВТ_Товары.Номенклатура
	|			И ЦеныНоменклатурыСрезПоследних.Характеристика = ВТ_Товары.Характеристика
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена > ВТ_Товары.Цена";
	
	
	Запрос.УстановитьПараметр("Товары", ЭтотОбъект.Товары); 
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	
	Запрос.УстановитьПараметр("ВидЦены", "НижнийПорогРентабельности");
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Ошибка  = "Цена позиции ниже порога рентабельности: строка №" 
		+ ВыборкаДетальныеЗаписи.НомерСтроки 
		+ "номенклатура "
		+ ВыборкаДетальныеЗаписи.Номенклатура ;
		Сообщить(Ошибка);
		
	КонецЦикла;
	
	Отказ = Истина;	
	
КонецПроцедуры          



Функция ПроверитьНаличиеРоли()	
	
	Пользователь = ?(ЗначениеЗаполнено(Пользователь), Пользователь, Пользователи.АвторизованныйПользователь());
	Роль = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Роль.Экз_ПроверкаНижнегоПорогаРентабельности");
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АвторизованныйПользователь", Пользователь);
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО (СоставыГруппПользователей.Пользователь = &АвторизованныйПользователь)
	|			И (СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
	|			И (СоставыГруппПользователей.Используется)
	|			И (НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	|			И (ПрофилиГруппДоступаРоли.Роль = &Роль)
	|			И (НЕ ПрофилиГруппДоступаРоли.Ссылка.ПометкаУдаления)";
	
	Выборка = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Пустой() Тогда		
		Возврат Истина;		
	Иначе 
		Возврат Ложь;				
	КонецЕсли;
	
КонецФункции	

