


&НаКлиенте
Процедура Экз_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	
	ТекущаяСтрокаТЧТовары  = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрокаТЧТовары.Экз_НижнийПорогРентабельности = РассчитатьНижнийПорогРентабельностиДляСтрокиТЧТовары(ТекущаяСтрокаТЧТовары.Номенклатура
	,ТекущаяСтрокаТЧТовары.Характеристика);
	
	
	
КонецПроцедуры        


&НаСервере
Функция РассчитатьНижнийПорогРентабельностиДляСтрокиТЧТовары(ТекущаяСтрокаТЧТовары.Номенклатура,ТекущаяСтрокаТЧТовары.Характеристика)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних";
	
	
	// Устанавливвем параметры
	//  Дата ДОКУМЕНТА !!!
	Запрос.УстановитьПараметр("Дата", Объект.Дата); 
	
	// Отдельно получаем из Спр. 
	ВидЦены_НижнийПорогРентабельности = Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор","НижнийПорогРентабельности"); 
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены_НижнийПорогРентабельности);
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НижнийПорогРентабельности = 0; 
	
	Если Выборка.Следующий() Тогда
		
		НижнийПорогРентабельности = Выборка.Цена;
		
	КонецЕсли;
	
	Возврат НижнийПорогРентабельности 
	
КонецФункции
