

Процедура ЭкзаменОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДопРеквизит
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя = &ИмяРеквизита
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйОрдерНаТовары.Номенклатура КАК Номенклатура,
	|	ПриходныйОрдерНаТовары.Серия.Номер КАК СерияНомер,
	|	ПриходныйОрдерНаТовары.Серия.ГоденДо КАК СерияГоденДо,
	|	ПриходныйОрдерНаТовары.Серия.ДатаПроизводства КАК СерияДатаПроизводства,
	|	РАЗНОСТЬДАТ(ПриходныйОрдерНаТовары.Серия.ДатаПроизводства, ПриходныйОрдерНаТовары.Серия.ГоденДо, ДЕНЬ) КАК СрокГодностиНорм,
	|	РАЗНОСТЬДАТ(ПриходныйОрдерНаТовары.Серия.ДатаПроизводства, Ссылка.Дата, ДЕНЬ) КАК СрокГодностиФакт,
	|	ПриходныйОрдерНаТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ТЧ_ДОК
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	ПриходныйОрдерНаТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗначенеДопРеквизита
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты,
	|	ВТ_ДопРеквизит КАК ВТ_ДопРеквизит,
	|	ВТ_ТЧ_ДОК КАК ВТ_ТЧ_ДОК
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ТЧ_ДОК.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТ_ТЧ_ДОК КАК ВТ_ТЧ_ДОК)
	|	И НоменклатураДополнительныеРеквизиты.Свойство В
	|			(ВЫБРАТЬ
	|				ВТ_ДопРеквизит.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_ДопРеквизит КАК ВТ_ДопРеквизит)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ_ДОК.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_ТЧ_ДОК.Номенклатура) КАК НоменклатураПредставление,
	|	ВТ_ТЧ_ДОК.СерияНомер КАК СерияНомер,
	|	ВТ_ТЧ_ДОК.СрокГодностиНорм КАК СрокГодностиНорм,
	|	ВТ_ТЧ_ДОК.СрокГодностиФакт КАК СрокГодностиФакт,
	|	ЕСТЬNULL(ВТ_ЗначенеДопРеквизита.Значение, 0) КАК ЗначениеДопРеквизита,
	|	ВТ_ТЧ_ДОК.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_ТЧ_ДОК КАК ВТ_ТЧ_ДОК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенеДопРеквизита КАК ВТ_ЗначенеДопРеквизита
	|		ПО ВТ_ТЧ_ДОК.Номенклатура = ВТ_ЗначенеДопРеквизита.Ссылка";
	
	Запрос.УстановитьПараметр("ИмяРеквизита", "_ПроцентГодности_2b6578d5f4b84b45afad3cf932d7c625 ");
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СрокГодностиНорм = 0  ИЛИ ВыборкаДетальныеЗаписи.СрокГодностиФакт = 0 Тогда 
			
			// ошибка ВВОДА Данных 				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В выбранной строке данные ведены не корректно";
			Сообщение.Поле = "Товары[" +Строка(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].Серия";
			Сообщение.УстановитьДанные(Источник);
			Сообщение.Сообщить(); 
			
			Отказ = Истина;
			
		ИначеЕсли  ВыборкаДетальныеЗаписи.СрокГодностиФакт / ВыборкаДетальныеЗаписи.СрокГодностиНорм *100 > 100 
			- ВыборкаДетальныеЗаписи.ЗначениеДопРеквизита  Тогда
			
			// Срок Годности МЕНЬШЕ  допустимого 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В выбранной строке  оставшийся срок годности меньше  допустимого";
			Сообщение.Поле = "Товары[" +Строка(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].Серия";			
			Сообщение.УстановитьДанные(Источник);			
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры
