

#Область СлужебныеПроцедурыИФункции

#Область Прочее

// последняя процедура в  Области

Процедура экз_ПроверитьДоступностьТовараПоОрдерам(Отказ)	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток - ВТ_Товары.Количество КАК Разница
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению.Остатки(&Дата, ДокументПоступления = &ПринятьПоФакту) КАК ТоварыКПоступлениюОстатки
	|		ПО ВТ_Товары.Номенклатура = ТоварыКПоступлениюОстатки.Номенклатура
	|			И ВТ_Товары.Характеристика = ТоварыКПоступлениюОстатки.Характеристика";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПринятьПоФакту", экз_ПринятьПоФакту);
	Запрос.УстановитьПараметр("Товары", Товары);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьОшибка = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Разница < 0 Тогда
			Сообщить("Превышено количество "  
			+ Выборка.Номенклатура 
			+ " на " 
			+ (- Выборка.Разница));
			
			ЕстьОшибка = Истина;
			
		КонецЕсли;			
	КонецЦикла;   
	
	Отказ = ЕстьОшибка;	
	
КонецПроцедуры

#КонецОбласти
	
#КонецОбласти

