
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ЗаполнитьПараметрыФормы(ПараметрКоманды);
	
	Если  ПараметрКоманды = Неопределено Тогда 			
		Сообщить("Приходный Ордер УЖЕ создан!"); 
		Возврат;	
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	
КонецПроцедуры   

&НаСервере		
Функция ЗаполнитьПараметрыФормы(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.экз_ПриятьПоФакту") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
		|	И ПриходныйОрдерНаТовары.Проведен
		|	И НЕ ПриходныйОрдерНаТовары.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Распоряжение", ПараметрКоманды);	
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда   			
			
			ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
			
			Возврат ПараметрыФормы;		

		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 