


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ЗаполнитьПараметрыФормы(ПараметрКоманды);
	
	Если ПараметрыФормы = Неопределено Тогда 
		Возврат	
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента",
	ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник,ПараметрыВыполненияКоманды.Уникальность, 
	ПараметрыВыполненияКоманды.Окно,ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере


Функция ЗаполнитьПараметрыФормы(ПараметрКоманды)
	
	ПараметрыФормы = Неопределено;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда  
		
		Если ТипЗнч(ПараметрКоманды.Распоряжение) = Тип("ДокументСсылка.экз_ПриятьПоФакту") Тогда 
			
			ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);		
			
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции // ()
